; domain
(define (domain dragonfly)

    ;remove requirements that are not needed
    ;(:requirements :strips)

    (:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
        lilypad - object
    )

    ; un-comment following line if constants are needed
    ;(:constants )

    (:predicates ;todo: define predicates here
        (alighted ?x - lilypad)
    )
    (:functions
        (north)
        (east)
        (up)
        (pad_north ?l - lilypad)
        (pad_east ?l - lilypad)
        (pad_up ?l - lilypad)
        (nectar-level)
        (nectar-level-full)
        (min_north)
        (max_north)
        (min_east)
        (max_east)
        (min_up)
        (max_up)
    )

    (:action fly_north
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (<= (north) (- (max_north) 1))
        )
        :effect (and (increase (north) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action fly_south
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (>= (north) (+ (min_north) 1))
        )
        :effect (and (decrease (north) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action fly_east
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (<= (east) (- (max_east) 1))
        )
        :effect (and (increase (east) 1)
            (decrease (nectar-level) 1)
        )
    )
    (:action fly_west
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (>= (east) (+ (min_east) 1))
        )
        :effect (and (decrease (east) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action fly_up
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (<= (up) (- (max_up) 1))
        )
        :effect (and (increase (up) 1)
            (decrease (nectar-level) 1)
        )
    )
    (:action fly_down
        :parameters ()
        :precondition (and
            (>= (nectar-level) 1)
            (>= (up) (+ (min_up) 1))
        )
        :effect (and (decrease (up) 1)
            (decrease (nectar-level) 1)
        )
    )

    (:action alight
        :parameters (?l - lilypad)
        :precondition (and
            (>= (nectar-level) 1)
            (= (pad_north ?l) (north))
            (= (pad_east ?l) (east))
            (= (pad_up ?l) (up))
        )
        :effect (and (alighted ?l)
            (decrease (nectar-level) 1))
    )

    (:action refuel_nectar
        :parameters ()
        :precondition (and
            (= (north) 0)
            (= (east) 0)
            (= (up) 0)
        )
        :effect (and
            (assign (nectar-level) (nectar-level-full)))
    )

)

; problem
;;Instance with 1x1x2 points
(define (problem name)
  (:domain dragonfly)
  (:objects
    pad_0_0_0 - lilypad
    pad_0_0_1 - lilypad
  )
  (:init
    (= (north) 0)
    (= (east) 0)
    (= (up) 0)
    (= (min_north) 0)
    (= (max_north) 1)
    (= (min_east) 0)
    (= (max_east) 1)
    (= (min_up) 0)
    (= (max_up) 2)
    (= (pad_north pad_0_0_0) 0)
    (= (pad_east pad_0_0_0) 0)
    (= (pad_up pad_0_0_0) 0)
    (= (pad_north pad_0_0_1) 0)
    (= (pad_east pad_0_0_1) 0)
    (= (pad_up pad_0_0_1) 1)
    (= (nectar-level) 9)
    (= (nectar-level-full) 9)
  )
  (:goal
    (and
      (alighted pad_0_0_0)
      (alighted pad_0_0_1)
      (= (north) 0) (= (east) 0) (= (up) 0))
  )
);; end of the problem instance

; plan
1. (alight pad_0_0_0)
   added: (alighted pad_0_0_0)
   changed: (nectar-level) from 9 to 8
   goals met: 4 of 5
2. (alight pad_0_0_0)
   changed: (nectar-level) from 8 to 7
   goals met: 4 of 5
3. (fly_up)
   changed: (up) from 0 to 1, (nectar-level) from 7 to 6
   goals met: 3 of 5
4. (alight pad_0_0_1)
   added: (alighted pad_0_0_1)
   changed: (nectar-level) from 6 to 5
   goals met: 4 of 5
5. (fly_down)
   changed: (up) from 1 to 0, (nectar-level) from 5 to 4
   goals met: 5 of 5
